In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'col1': [0, 1], 'col_left': ['a', 'b']})
df1

   col1 col_left
0     0        a
1     1        b

In [3]:
df2 = pd.DataFrame({'col1': [1, 2, 2], 'col_right': [2, 2, 2]})
df2

   col1  col_right
0     1          2
1     2          2
2     2          2

In [4]:
pd.merge(df1, df2, on='col1', how='outer', indicator=True)

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

In [5]:
pd.merge(df1, df2, on='col1', how='outer', indicator='indicator_column')

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     2      NaN        2.0       right_only
3     2      NaN        2.0       right_only

In [6]:
left = pd.DataFrame({'key': [1], 'v1': [10]})
left

   key  v1
0    1  10

In [7]:
right = pd.DataFrame({'key': [1, 2], 'v1': [20, 30]})
right

   key  v1
0    1  20
1    2  30

In [8]:
pd.merge(left, right, how='outer')

   key  v1
0    1  10
1    1  20
2    2  30

In [9]:
pd.merge(left, right, how='outer').dtypes

key    int64
v1     int64
dtype: object

In [10]:
pd.merge(left, right, how='outer', on='key')

   key  v1_x  v1_y
0    1  10.0    20
1    2   NaN    30

In [11]:
pd.merge(left, right, how='outer', on='key').dtypes

key       int64
v1_x    float64
v1_y      int64
dtype: object

In [14]:
from pandas.api.types import CategoricalDtype
import numpy as np

In [25]:
X = pd.Series(np.random.choice(['foo', 'bar'], size=(10,)))
X

0    bar
1    foo
2    bar
3    bar
4    bar
5    foo
6    bar
7    foo
8    foo
9    bar
dtype: object

In [26]:
X = X.astype(CategoricalDtype(categories=['foo', 'bar']))
X

0    bar
1    foo
2    bar
3    bar
4    bar
5    foo
6    bar
7    foo
8    foo
9    bar
dtype: category
Categories (2, object): ['foo', 'bar']

In [29]:
left = pd.DataFrame({'X': X,
   'Y': np.random.choice(['one', 'two', 'three'],
   size=(10,))})
left

     X      Y
0  bar    one
1  foo    one
2  bar  three
3  bar    two
4  bar    two
5  foo  three
6  bar    one
7  foo    one
8  foo  three
9  bar    one

In [30]:
left.dtypes

X    category
Y      object
dtype: object

In [32]:
right = pd.DataFrame({'X': pd.Series(['foo', 'bar'],
                                     dtype=CategoricalDtype(['foo', 'bar'])),
                      'Z': [1, 2]})
right

     X  Z
0  foo  1
1  bar  2

In [33]:
right.dtypes

X    category
Z       int64
dtype: object

In [34]:
result = pd.merge(left, right, how='outer')
result

     X      Y  Z
0  bar    one  2
1  bar  three  2
2  bar    two  2
3  bar    two  2
4  bar    one  2
5  bar    one  2
6  foo    one  1
7  foo  three  1
8  foo    one  1
9  foo  three  1

In [35]:
result.dtypes

X    category
Y      object
Z       int64
dtype: object

In [36]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [37]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [38]:
result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [39]:
result = left.join(right, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [40]:
result = left.join(right, how='inner')
result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [41]:
result = pd.merge(left, right, left_index=True, right_index=True, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [42]:
result = pd.merge(left, right, left_index=True, right_index=True, how='inner')
result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [43]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                  'key': ['K0', 'K1', 'K0', 'K1']})
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

In [44]:
right = pd.DataFrame({'C': ['C0', 'C1'],
                      'D': ['D0', 'D1']},
                    index=['K0', 'K1'])
right

     C   D
K0  C0  D0
K1  C1  D1

In [46]:
result = left.join(right, on='key')
result

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

In [47]:
result = pd.merge(left, right, left_on='key', right_index=True,
                     how='left', sort=False)
result

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

In [48]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=pd.Index(['K0', 'K1', 'K2'], name='key'))
left

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2

In [49]:
index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                   ('K2', 'Y2'), ('K2', 'Y3')],
                                   names=['key', 'Y'])

index

MultiIndex([('K0', 'Y0'),
            ('K1', 'Y1'),
            ('K2', 'Y2'),
            ('K2', 'Y3')],
           names=['key', 'Y'])

In [50]:
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},
                     index=index)
right

         C   D
key Y
K0  Y0  C0  D0
K1  Y1  C1  D1
K2  Y2  C2  D2
    Y3  C3  D3

In [52]:
left

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2

In [51]:
result = left.join(right, how='inner')
result

         A   B   C   D
key Y
K0  Y0  A0  B0  C0  D0
K1  Y1  A1  B1  C1  D1
K2  Y2  A2  B2  C2  D2
    Y3  A2  B2  C3  D3

In [53]:
leftindex = pd.MultiIndex.from_product([list('abc'), list('xy'), [1, 2]],
                                        names=['abc', 'xy', 'num'])
leftindex

MultiIndex([('a', 'x', 1),
            ('a', 'x', 2),
            ('a', 'y', 1),
            ('a', 'y', 2),
            ('b', 'x', 1),
            ('b', 'x', 2),
            ('b', 'y', 1),
            ('b', 'y', 2),
            ('c', 'x', 1),
            ('c', 'x', 2),
            ('c', 'y', 1),
            ('c', 'y', 2)],
           names=['abc', 'xy', 'num'])

In [54]:
left = pd.DataFrame({'v1': range(12)}, index=leftindex)
left

            v1
abc xy num
a   x  1     0
       2     1
    y  1     2
       2     3
b   x  1     4
       2     5
    y  1     6
       2     7
c   x  1     8
       2     9
    y  1    10
       2    11

In [56]:
rightindex = pd.MultiIndex.from_product([list('abc'), list('xy')],
                                         names=['abc', 'xy'])
rightindex

MultiIndex([('a', 'x'),
            ('a', 'y'),
            ('b', 'x'),
            ('b', 'y'),
            ('c', 'x'),
            ('c', 'y')],
           names=['abc', 'xy'])

In [57]:
right = pd.DataFrame({'v2': [100 * i for i in range(1, 7)]}, index=rightindex)
right

         v2
abc xy
a   x   100
    y   200
b   x   300
    y   400
c   x   500
    y   600

In [58]:
left.join(right, on=['abc', 'xy'], how='inner')

            v1   v2
abc xy num
a   x  1     0  100
       2     1  100
    y  1     2  200
       2     3  200
b   x  1     4  300
       2     5  300
    y  1     6  400
       2     7  400
c   x  1     8  500
       2     9  500
    y  1    10  600
       2    11  600

In [59]:
leftindex = pd.MultiIndex.from_tuples([('K0', 'X0'), ('K0', 'X1'),
                                        ('K1', 'X2')],
                                       names=['key', 'X'])
 

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=leftindex)
 

rightindex = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                         ('K2', 'Y2'), ('K2', 'Y3')],
                                        names=['key', 'Y'])
 

right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']},
                      index=rightindex)


result = pd.merge(left.reset_index(), right.reset_index(),
                   on=['key'], how='inner').set_index(['key', 'X', 'Y'])

In [60]:
left

         A   B
key X
K0  X0  A0  B0
    X1  A1  B1
K1  X2  A2  B2

In [61]:
right

         C   D
key Y
K0  Y0  C0  D0
K1  Y1  C1  D1
K2  Y2  C2  D2
    Y3  C3  D3

In [62]:
result

            A   B   C   D
key X  Y
K0  X0 Y0  A0  B0  C0  D0
    X1 Y0  A1  B1  C0  D0
K1  X2 Y1  A2  B2  C1  D1

In [63]:
left_index = pd.Index(['K0', 'K0', 'K1', 'K2'], name='key1')

left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3'],
                      'key2': ['K0', 'K1', 'K0', 'K1']},
                     index=left_index)

right_index = pd.Index(['K0', 'K1', 'K2', 'K2'], name='key1')

right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3'],
                       'key2': ['K0', 'K0', 'K0', 'K1']},
                      index=right_index)

result = left.merge(right, on=['key1', 'key2'])

In [64]:
left

       A   B key2
key1
K0    A0  B0   K0
K0    A1  B1   K1
K1    A2  B2   K0
K2    A3  B3   K1

In [65]:
right

       C   D key2
key1
K0    C0  D0   K0
K1    C1  D1   K0
K2    C2  D2   K0
K2    C3  D3   K1

In [66]:
result

       A   B key2   C   D
key1
K0    A0  B0   K0  C0  D0
K1    A2  B2   K0  C1  D1
K2    A3  B3   K1  C3  D3

In [67]:
left = pd.DataFrame({'k': ['K0', 'K1', 'K2'], 'v': [1, 2, 3]})

right = pd.DataFrame({'k': ['K0', 'K0', 'K3'], 'v': [4, 5, 6]})

result = pd.merge(left, right, on='k')

In [68]:
left

    k  v
0  K0  1
1  K1  2
2  K2  3

In [69]:
right

    k  v
0  K0  4
1  K0  5
2  K3  6

In [70]:
result

    k  v_x  v_y
0  K0    1    4
1  K0    1    5

In [71]:
result = pd.merge(left, right, on='k', suffixes=('_l', '_r'))
result

    k  v_l  v_r
0  K0    1    4
1  K0    1    5

In [72]:
left = left.set_index('k')

right = right.set_index('k')

result = left.join(right, lsuffix='_l', rsuffix='_r')

In [73]:
left

    v
k
K0  1
K1  2
K2  3

In [74]:
right

    v
k
K0  4
K0  5
K3  6

In [75]:
result

    v_l  v_r
k
K0    1  4.0
K0    1  5.0
K1    2  NaN
K2    3  NaN

In [76]:
right2 = pd.DataFrame({'v': [7, 8, 9]}, index=['K1', 'K1', 'K2'])

result = left.join([right, right2])

    v_x  v_y    v
K0    1  4.0  NaN
K0    1  5.0  NaN
K1    2  NaN  7.0
K1    2  NaN  8.0
K2    3  NaN  9.0

In [77]:
left

    v
k
K0  1
K1  2
K2  3

In [78]:
right

    v
k
K0  4
K0  5
K3  6

In [79]:
right2

    v
K1  7
K1  8
K2  9

In [80]:
result

    v_x  v_y    v
K0    1  4.0  NaN
K0    1  5.0  NaN
K1    2  NaN  7.0
K1    2  NaN  8.0
K2    3  NaN  9.0

In [81]:
df1 = pd.DataFrame([[np.nan, 3., 5.], [-4.6, np.nan, np.nan],
                    [np.nan, 7., np.nan]])
 

df2 = pd.DataFrame([[-42.6, np.nan, -8.2], [-5., 1.6, 4]],
                   index=[1, 2])

In [82]:
df1

     0    1    2
0  NaN  3.0  5.0
1 -4.6  NaN  NaN
2  NaN  7.0  NaN

In [83]:
df2

      0    1    2
1 -42.6  NaN -8.2
2  -5.0  1.6  4.0

In [84]:
result = df1.combine_first(df2)
result

     0    1    2
0  NaN  3.0  5.0
1 -4.6  NaN -8.2
2 -5.0  7.0  4.0

In [85]:
df1.update(df2)

In [86]:
df1

      0    1    2
0   NaN  3.0  5.0
1 -42.6  NaN -8.2
2  -5.0  1.6  4.0

In [89]:
left = pd.DataFrame({'k': ['K0', 'K1', 'K1', 'K2'],
                     'lv': [1, 2, 3, 4],
                     's': ['a', 'b', 'c', 'd']})

right = pd.DataFrame({'k': ['K1', 'K2', 'K4'],
                      'rv': [1, 2, 3]})

In [90]:
left

    k  lv  s
0  K0   1  a
1  K1   2  b
2  K1   3  c
3  K2   4  d

In [91]:
right

    k  rv
0  K1   1
1  K2   2
2  K4   3

In [95]:
pd.merge_ordered(left, right, fill_method='ffill', left_by='s')

     k   lv  s   rv
0   K0  1.0  a  NaN
1   K1  1.0  a  1.0
2   K2  1.0  a  2.0
3   K4  1.0  a  3.0
4   K1  2.0  b  1.0
5   K2  2.0  b  2.0
6   K4  2.0  b  3.0
7   K1  3.0  c  1.0
8   K2  3.0  c  2.0
9   K4  3.0  c  3.0
10  K1  NaN  d  1.0
11  K2  4.0  d  2.0
12  K4  4.0  d  3.0

In [94]:
pd.merge_ordered(left, right, left_by='s')

     k   lv  s   rv
0   K0  1.0  a  NaN
1   K1  NaN  a  1.0
2   K2  NaN  a  2.0
3   K4  NaN  a  3.0
4   K1  2.0  b  1.0
5   K2  NaN  b  2.0
6   K4  NaN  b  3.0
7   K1  3.0  c  1.0
8   K2  NaN  c  2.0
9   K4  NaN  c  3.0
10  K1  NaN  d  1.0
11  K2  4.0  d  2.0
12  K4  NaN  d  3.0